{"maxScore":120,"testedAt":"2020-07-01T12:20:00+02:00","name":"Expected Domains","testType":"assertion","version":5,"code":"W0130","description":"For multiple domains website, it is possible that sometimes there will appear domains which are not wanted to be covered in measurement. This test checks if there are any unexpected and generally unwanted hostnames. The test needs to be configured by listing domains that are allowed and that are required to be measured in data. Run the test once and based on the results configure the following arrays. \n<link-to-info> More information available in the <a href=https://github.com/crossmasters/waaila/tree/master/app/templates/waaila-hostnames-multiple/W0130-Expected%20Domains#further-information>test's documentation</a> .","lang":"en","sourceTestsetId":"waaila-hostnames-multiple","guid":"82073930-259e-43b1-995e-83928e7731ef","🇸ourceLibraryId":"waaila","sourceVersion":4,"createdAt":"2020-06-01T00:00:00","furtherInfo":"This test depends on your insertion of acceptable values of hostnames in the data. For the first part of the test you need to input list of hostnames that need to appear always in your data (the parameter necessaryDomainsArray). For the second part of the test you need to add hostnames which are permitted to appear in your data. You do this by constructing the permittedDomainsArray parameter which needs to contain all the values from the necessaryDomainsArray and in addition the values of hostnames that are additionally allowed to appear.</br>You can run the test first with the default parameters. When running with the default parameters, you can disregard the first part which will inform you that 'main-domain.com' and 'other-domain.com' are missing in your data. The second part will provide you with an overview of all hostnames currently measured in your data. Use this overview by copying the values into both parameters to configure test for your case.","adminLibraryTestsetId":"fffff3f9-7fc7-4c7e-be74-8be7e18ae01a","adminLibraryGuid":"75e6885b-0417-4e46-9891-3e64048d4573","constants":[{"type":"array","name":"necessaryDomainsArray","description":"list of domains that are required to be present in the data","example":"['main-domain.com', 'other-domain.com']","value":"['main-domain.com', 'other-domain.com']"},{"type":"array","name":"permittedDomainsArray","description":"list of all domains that are allowed to be present in the data (N/A denotes undefined value)","example":"['main-domain.com', 'other-domain.com', 'N/A']","value":"['main-domain.com', 'other-domain.com', 'N/A']"}],"blocks":[{"nr":"1","type":"@assert","description":"Check that none of the necessary domains disappeared.","score":60,"passMessage":"No necessary domains are missing in the data.","failMessage":"There are some necessary domains that are missing in the data: ${missingDomainsArrayMessage}"},{"nr":"2","type":"@assert","description":"Check that there is no unexpected domain included.","score":60,"passMessage":"No unexpected domains are measured in the data.","failMessage":"There are some sessions on unexpected domains:"}]}