{"maxScore":80,"testedAt":"2020-07-01T12:20:00+02:00","name":"Visits on single domain website","testType":"check","version":5,"code":"W0110","description":"In a single domain website, most of the traffic shall be aligned to only one hostname. If the traffic splits among multiple hostnames, there is a potential of a badly configured google analytics. Also, there should be minimum of traffic from other hostnames not belonging to owners’ website (typically hostnames like: google translate, google web cache). Hostnames starting with „localhost..“ are always wrong. In main view with clear data, these hostnames should be excluded.","lang":"en","guid":"78105052-a465-4dce-8762-c3e7aae22a84","createdAt":"2020-06-01T00:00:00","constants":[{"type":"number","name":"sessionThreshold","description":"share of sessions on the main domain should be above this threshold ","example":0.98,"value":0.98},{"type":"number","name":"nrHostnamesDisplayed","description":"maximum number of largest hostnames displayed in case of failure ","example":10,"value":10}],"blocks":[{"nr":"1","type":"@warn","description":"Loads data and checks for presence of data for sessions by hostname","score":0,"failMessage":"No data returned for sessions by hostname."},{"nr":"2","type":"@assert","description":"It checks if the largest hostname has more than ${sessionThreshold} *100 % of all visits. Largest hostnames displayed in case of assert failure, based on ${nrHostnamesDisplayed} parameter","score":80,"passMessage":"Ratio of traffic on the most frequent hostname (${hostName}) to all traffic is higher than ${sessionThreshold*100} %","failMessage":"Ratio of traffic on the most frequent hostname  (${hostName}) to all traffic is not higher than ${sessionThreshold*100} %","failHowtofix":"Check if there is some filter for inclusion of hostnames applied, if not, create one. It should be an include filter with defined main hostname.","failTableDescribe":"Sample of largest hostnames (${Math.min(nrHostnamesDisplayed, hostnamesLength)} / ${hostnamesLength}):"}]}