{"maxScore":80,"testedAt":"2020-07-01T12:20:00+02:00","name":"Conversions on single domain website","testType":"check","version":5,"code":"W0140","description":"In a single domain website, most of the conversions shall be aligned to only one hostname. If the conversions split among multiple hostnames, there is a potential of a badly configured google analytics. If most of the transactions do not come from the main hostname, it indicates that your users are converting using another hostname and this will result in a loss of data measured. Also, there should be minimum of conversions from other domains not belonging to the owners’ websites (typically domains like: google translate, google web cache). Hostnames starting with „localhost...“ are always wrong. In main view with clear data, these hostnames should be excluded.","lang":"en","guid":"fbbe2a16-f0de-433b-ab21-a1f24c1ef486","createdAt":"2020-06-01T00:00:00","constants":[{"type":"number","name":"transactionThreshold","description":"share of sessions on the main domain should be above this threshold ","example":0.98,"value":0.98},{"type":"number","name":"nrHostnamesDisplayed","description":"maximum number of largest hostnames displayed in case of failure ","example":10,"value":10}],"blocks":[{"nr":"1","type":"@warn","description":"It checks presence of data for transactions by hostname","score":0},{"nr":"2","type":"@assert","description":"Evaluates the total of the transactions made and reports about the amount of transactions generated by each hostname to see the hostname detaining the most transactions among your websites.","score":80,"passMessage":"Ratio of transactions on the most frequent hostname  (${hostName}) to all transactions is higher than ${sessionThreshold*100} %","failMessage":"Ratio of transactions on the most frequent hostname  (${hostName}) to all transactions is not higher than ${sessionThreshold*100} %","failHowtofix":"Check if there is some filter for inclusion of hostnames applied, if not, create one. It should be include filter with defined main hostname.","failTableDescribe":"Sample of largest hostnames (${Math.min(nrHostnamesDisplayed, hostnamesLength)} / ${hostnamesLength}):"}]}